# IsSTLImportLinkAvailable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OptionalFunctionalityUtils..::..IsSTLImportLinkAvailable Method
OptionalFunctionalityUtils Class See Also
---
Checks whether the STL Import/Link functionality is available in the installed Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public static bool IsSTLImportLinkAvailable()
```

Visual Basic
---
```text
Public Shared Function IsSTLImportLinkAvailable As Boolean
```

Visual C++
---
```text
public:
static bool IsSTLImportLinkAvailable()
```

# ### Return Value
True if the STL Import/Link functionality is available in the installed Revit.
# Remarks
STL Import/Link is optional functionality that does not have to be a part of the Revit installation.
# See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace